# Напишите программу которая на вход принимает число N  и выдает последовательность из N членов

for i in range(int(input("Введите число "))):
    print((-3) **i, end = " ")
