# напишите программу в которой пользователь будет задавать две строки, программа - определять количество вхождений одной строки в другой

n = input("Введите 1 строку ")
n2 = input("Введите 2 строку ")
print (n.count (n2))